Repository: fatihtarakc/InveonFullStackBootcamp2024FinalProject
Catalog: CourseApp.Backend/InveonCourseApp.Backend.Core/Resources/MessageResources.*.resx
Languages: tr_tr

# Account_Birthdate_Age_Cannot_Be_LessThan_7YearsOld
source: You cannot be less than 7 years old !
tr_tr: 7 yaşından daha küçük olamazsınız !

# Account_Digits_ForName_Cannot_Be_Used
source: Digits cannot be used for name !
tr_tr: Ad için rakam kullanılamaz !

# Account_Digits_ForSurname_Cannot_Be_Used
source: Digits cannot be used for surname !
tr_tr: Soyad için rakam kullanılamaz !

# Account_Digits_ForUsername_Cannot_Be_Used
source: Digits cannot be used for username !
tr_tr: Kullanıcı adı için rakam kullanılamaz !

# Account_Email_Cannot_Be_GreaterThan_50Characters
source: Email length cannot be greater than 50 characters !
tr_tr: Email adresi en fazla 50 karakterden oluşmalıdır

# Account_Email_Cannot_Be_LessThan_10Characters
source: Email length cannot be less than 10 characters !
tr_tr: Email adresi en az 10 karakterden oluşmalıdır !

# Account_Email_Has_Already_Existed
source: This email address can not be used !
tr_tr: Bu email adresi kullanılamaz !

# Account_Email_Has_Not_Confirmed
source: This email address has not confirmed yet !
tr_tr: Bu email adresi henüz onaylanmamış !

# Account_Email_Was_Confirmed
source: Email address was confirmed !
tr_tr: Email adresi doğrulandı !

# Account_Has_Not_Activated
source: This account has not activated yet !
tr_tr: Bu hesap henüz aktive edilmemiş !

# Account_Name_Cannot_Be_GreaterThan_25Characters
source: Name length cannot be greater than 25 characters !
tr_tr: Adınız en fazla 25 karakterden oluşmalıdır !

# Account_Name_Cannot_Be_LessThan_2Characters
source: Name length cannot be less than 2 characters !
tr_tr: Adınız en az 2 karakterden oluşmalıdır !

# Account_Password_Cannot_Be_GreaterThan_25Characters
source: Password length cannot be greater than 25 characters !
tr_tr: Şifre en fazla 25 karakterden oluşmalıdır !

# Account_Password_Cannot_Be_LessThan_8Characters
source: Password length cannot be less than 8 characters !
tr_tr: Şifre en az 8 karakterden oluşmalıdır !

# Account_Password_Must_Include_1Digit_AtLeast
source: Password must include one number at least!
tr_tr: Şifre en az bir rakam içermelidir !

# Account_Password_Must_Include_1LowerLetter_AtLeast
source: Password must include one lower letter at least !
tr_tr: Şifre en az bir küçük karakter içermelidir !

# Account_Password_Must_Include_1Symbol_AtLeast
source: Password must include one symbol at least !
tr_tr: Şifre en az bir sembol içermelidir !

# Account_Password_Must_Include_1UpperLetter_AtLeast
source: Password must include one upper letter at least !
tr_tr: Şifre en az bir büyük karakter içermelidir !

# Account_Please_Enter_Your_Birthdate
source: Please enter your birthdate !
tr_tr: Lütfen doğum tarihinizi giriniz !

# Account_Please_Enter_Your_Email
source: Please enter your email address !
tr_tr: Lütfen email adresinizi giriniz !

# Account_Please_Enter_Your_Name
source: Please enter your name !
tr_tr: Lütfen adınızı giriniz !

# Account_Please_Enter_Your_Password
source: Please enter your password !
tr_tr: Lütfen şifrenizi giriniz !

# Account_Please_Enter_Your_Surname
source: Please enter your surname !
tr_tr: Lütfen soyadınızı giriniz !

source: Account role was not found for identity user !
tr_tr: Kullanıcı kimliği için hesap rolü bulunamadı !

# Account_SignIn_Failed
source: Login failed. This email address or password is incorrect !
tr_tr: Giriş başarısız. Email adresi veya şifre hatalı !

# Account_SignIn_Successful
source: Login successful !
tr_tr: Giriş başarılı !

# Account_Surname_Cannot_Be_GreaterThan_25Characters
source: Surname length cannot be greater than 25 characters !
tr_tr: Soyadınız en fazla 25 karakterden oluşmalıdır !

# Account_Surname_Cannot_Be_LessThan_2Characters
source: Surname legth cannot be less than 2 characters !
tr_tr: Soyadınız en az 2 karakterden oluşmalıdır !

# Account_Symbols_ForName_Cannot_Be_Used
source: Symbols cannot be used for name !
tr_tr: Ad için sembol kullanılamaz !

# Account_Symbols_ForSurname_Cannot_Be_Used
source: Symbols cannot be used for surname !
tr_tr: Soyad için sembol kullanılamaz !

# Account_Symbols_ForUsername_Cannot_Be_Used
source: Symbols cannot be used for username !
tr_tr: Kullanıcı adı için sembol kullanılamaz !

# Account_TurkishCharacters_ForEmail_Cannot_Be_Used
source: Turkish charachters cannot be used for email !
tr_tr: Email adresi için türkçe karakter kullanılamaz !

# Account_TurkishCharacters_ForUsername_Cannot_Be_Used
source: Turkish charachters cannot be used for username !
tr_tr: Kullanıcı adı için türkçe karakter kullanılamaz !

# Account_UpperLetters_ForUsername_Cannot_Be_Used
source: Upper letters cannot be used for username !
tr_tr: Kullanıcı adı için büyük harf kullanılamaz !

# Account_Username_Cannot_Be_GreaterThan_20Characters
source: Username length cannot be greater than 20 characters !
tr_tr: Kullanıcı adınız en fazla 20 karakterden oluşmalıdır !

# Account_Username_Cannot_Be_LessThan_5Characters
source: Userame length cannot be less than 5 characters !
tr_tr: Kullanıcı adınız en az 5 karakterden oluşmalıdır !

# Account_Username_Has_Already_Existed
source: This username can not be used !
tr_tr: Bu username kullanılamaz !

source: Account was activated !
tr_tr: Hesap etkinleştirildi !

source: Account was found !
tr_tr: Hesap bulundu !

source: Account was not found !
tr_tr: Hesap bulunamadı !

source: Admin was found by email !
tr_tr: Email'e göre admin bulundu !

source: Admin was found by id !
tr_tr: Id'ye göre admin bulundu !

source: Admin was found by identity id !
tr_tr: IdentityId'ye göre admin bulundu !

source: Admin was not found by email !
tr_tr: Email'e göre admin bulunamadı !

source: Admin was not found by id !
tr_tr: Id'ye göre admin bulunamadı !

source: Admin was not found by identity id !
tr_tr: IdentityId'ye göre admin bulunamadı !

# EmailContent_Has_Been_Sent_For_ActivateAccount
source: Inveon Course App account activation code
tr_tr: Inveon Course App hesabı aktivasyon kodu

# EmailContent_Has_Been_Sent_For_ConfirmEmail
source: Inveon Course App account email verification code
tr_tr: Inveon Course App hesabı email doğrulama kodu

# EmailContent_Has_Been_Sent_For_NewStudent
source: Your new student account was created in Inveon Course App !
tr_tr: Inveon Course App'te yeni öğrenci hesabınız oluşturuldu !

# EmailContent_Has_Been_Sent_For_NewTrainer
source: Your new trainer account was created in Inveon Course App !
tr_tr: Inveon Course App'te yeni eğitmen hesabınız oluşturuldu !

# EmailContent_Has_Been_Sent_For_TwoFactorAuthentication
source: Inveon Course App account two factor authentication process verification code
tr_tr: Inveon Course App hesabı iki faktörlü kimlik doğrulama işlemi doğrulama kodu

# EmailSubject_Has_Been_Sent_For_ActivateAccount
source: Inveon Course App account activation code !
tr_tr: Inveon Course App hesabı aktivasyon kodu !

# EmailSubject_Has_Been_Sent_For_ConfirmEmail
source: Inveon Course App account email verification code !
tr_tr: Inveon Course App hesabı email doğrulama kodu !

# EmailSubject_Has_Been_Sent_For_NewStudent
source: New Inveon Course App student account !
tr_tr: Yeni Inveon Course App öğrenci hesabı !

# EmailSubject_Has_Been_Sent_For_NewTrainer
source: New Inveon Course App trainer account !
tr_tr: Yeni Inveon Course App eğitmen hesabı !

# EmailSubject_Has_Been_Sent_For_TwoFactorAuthentication
source: Inveon Course App account two factor authentication process verification code !
tr_tr: Inveon Course App hesabı iki faktörlü kimlik doğrulama işlemi doğrulama kodu !

# EmailTitle_Has_Been_Sent_For_ActivateAccount
source: Hello
tr_tr: Merhaba

# EmailTitle_Has_Been_Sent_For_ConfirmEmail
source: Hello
tr_tr: Merhaba

# EmailTitle_Has_Been_Sent_For_NewStudent
source: Hello
tr_tr: Merhaba

# EmailTitle_Has_Been_Sent_For_NewTrainer
source: Hello
tr_tr: Merhaba

# EmailTitle_Has_Been_Sent_For_TwoFactorAuthentication
source: Hello
tr_tr: Merhaba

source: Email sending process was failed !
tr_tr: Email gönderme işlemi başarısız !

source: Email sending process was successful !
tr_tr: Email gönderme işlemi başarılı !

# Rabbitmq_EnqueueModelProcess_Was_Failed
source: With Rabbitmq, enqueue model process was failed !
tr_tr: Rabbitmq ile modeli kuyruğa alma işlemi başarısız !

# Rabbitmq_EnqueueModelProcess_Was_Successful
source: With Rabbitmq, enqueue model process was successful !
tr_tr: Rabbitmq ile modeli kuyruğa alma işlemi başarılı !

# Rabbitmq_EnqueueModelsProcess_Were_Failed
source: With Rabbitmq, enqueue models process were failed !
tr_tr: Rabbitmq ile modelleri kuyruğa alma işlemi başarısız !

# Rabbitmq_EnqueueModelsProcess_Were_Successful
source: With Rabbitmq, enqueue models process were successful !
tr_tr: Rabbitmq ile modelleri kuyruğa alma işlemi başarılı !

# Rabbitmq_StartSendingEmailProcess_Was_Failed
source: With Rabbitmq, start sending email process was failed !
tr_tr: Rabbitmq ile email gönderme işlemi başarısız !

# Rabbitmq_StartSendingEmailProcess_Was_Successful
source: With Rabbitmq, start sending email process was successful !
tr_tr: Rabbitmq ile email gönderme işlemi başarılı !

# Redis_Cache_Entity_Was_Added
source: Entity was added to Redis cache !
tr_tr: Redis önbelleğine entity eklendi !

# Redis_Cache_Entity_Was_Found
source: Entity was found in Redis cache !
tr_tr: Redis önbelleğinde entity bulundu !

# Redis_Cache_Entity_Could_Not_Be_Added
source: Entity could not be added to Redis cache !
tr_tr: Redis önbelleğine entity eklenemedi !

# Redis_Cache_Entity_Was_Not_Found
source: Entity was not found in Redis cache !
tr_tr: Redis önbelleğinde entity bulunamadı !

# Student_Could_Not_Added
source: Student could not be added !
tr_tr: Öğrenci eklenemedi !

source: Student was added successfully !
tr_tr: Öğrenci başarılı bir şekilde eklendi !

source: Student was found by email !
tr_tr: Email'e göre öğrenci bulundu !

source: Student was found by id !
tr_tr: Id'ye göre öğrenci bulundu !

source: Student was found by identity id !
tr_tr: IdentityId'ye göre student bulundu !

source: Student was not found by email !
tr_tr: Email'e göre öğrenci bulunamadı !

source: Student was not found by id !
tr_tr: IdentityId'ye göre öğrenci bulunamadı !

source: Student was not found by identity id !
tr_tr: IdentityId'ye göre öğrenci bulunamadı !

source: Token could not generated !
tr_tr: Token üretilemedi !

source: Token was generated successfully !
tr_tr: Token başarılı bir şekilde üretildi !

source: Trainer was found by email !
tr_tr: Email'e göre eğitmen bulundu !

source: Trainer was found by id !
tr_tr: Id'ye göre eğitmen bulundu !

source: Trainer was found by identity id !
tr_tr: IdentityId'ye göre eğitmen bulundu !

source: Trainer was not found by email !
tr_tr: Email'e göre eğitmen bulunamadı !

source: Trainer was not found by id !
tr_tr: Id'ye göre öğrenci bulunamadı !

source: Trainer was not found by identity id !
tr_tr: IdentityId'ye göre eğitmen bulunamadı !

# Account_Email_Is_Invalid
source: This email address is invalid !
tr_tr: Geçersiz email adresi !

# EmailTitle_Has_Been_Sent_For_ResetPassword
source: Hello
tr_tr: Merhaba

# EmailSubject_Has_Been_Sent_For_ResetPassword
source: Inveon Course App account password reset process verification code
tr_tr: Inveon Course App hesabı şifre sıfırlama işlemi doğrulama kodu

# EmailContent_Has_Been_Sent_For_ResetPassword
source: Inveon Course App account password reset process verification code
tr_tr: Inveon Course App hesabı şifre sıfırlama işlemi doğrulama kodu

# Account_Please_Enter_Your_VerificationCode
source: Please enter your verification code !
tr_tr: Lütfen doğrulama kodunuzu giriniz !

# Account_Please_Select_Your_VerificationType
source: Please select your verification type !
tr_tr: Lütfen doğrulama tipini seçiniz !

# Account_Please_Select_Correct_VerificationType
source: Please select correct verification type !
tr_tr: Lütfen doğru doğrulama tipini seçiniz !

# Account_VerificationCode_Cannot_Be_GreaterThan_50Characters
source: Verification code length cannot be greater than 50 characters !
tr_tr: Doğrulama kodu en fazla 50 karakterden oluşmalıdır !

# Account_VerificationCode_Is_Invalid
source: This verification code is invalid !
tr_tr: Geçersiz doğrulama kodu !

# Account_ResetPassword_Failed
source: Password reset failed ! Please try again later !
tr_tr: Şifre sıfırlama başarısız ! Lütfen daha sonra tekrar deneyiniz !

# Account_ResetPassword_Successful
source: Password sıfırlama successful !
tr_tr: Şifre sıfırlama başarılı !

# Account_ActivateAccount_Failed
source: Account activate failed !
tr_tr: Hesap etkinleştirme başarısız !

# Account_ActivateAccount_Successful
source: Account activate successful !
tr_tr: Hesap etkinleştirme başarılı !

# Account_ConfirmEmail_Failed
source: Email confirm failed !
tr_tr: Email doğrulama başarısız !

# Account_ConfirmEmail_Successful
source: Email confirm successful !
tr_tr: Email doğrulama başarılı !

# Account_Please_Enter_Your_Email_With_Correct_Format
source: Please enter your email address correctly !
tr_tr: Lütfen email adresini giriniz !

# Account_Please_Take_New_VerificationCode
source: Please take a new verification code !
tr_tr: Lütfen yeni bir doğrulama kodu alınız !

source: Account has already been activated !
tr_tr: Bu hesap zaten etkinleştirilmiş !

# Account_Email_Has_Already_Been_Confirmed
source: Email address has alreay been confirmed !
tr_tr: Email adresi zaten onaylanmış !

source: Please activate your account again !
tr_tr: Lütfen hesabınızı tekrar etkinleştirin !

source: Admin was not found by username !
tr_tr: Username'e göre admin bulunamadı !

source: Admin was found by username !
tr_tr: Username'e göre admin bulundu !

source: Student was not found by username !
tr_tr: Username'e göre öğrenci bulunamadı !

source: Student was found by username !
tr_tr: Username'e göre student bulundu !

source: Trainer was not found by username !
tr_tr: Username'e göre eğitmen bulunamadı !

source: Trainer was found by username !
tr_tr: Username'e göre eğitmen bulundu !

# Student_Can_Not_Be_Trainer
source: You cannot be a trainer because of younger than 18 years old !
tr_tr: 18 yaşından küçük olmanız nedeniyle eğitmen olamazsınız !

# Student_Can_Be_Trainer
source: You are suitable to be trainer !
tr_tr: Eğitmen olmak için uygunsunuz !

# Trainer_Could_Not_Added
source: Trainer could not be added !
tr_tr: Eğitmen eklenemedi !

source: Trainer was added successfully !
tr_tr: Eğitmen başarılı bir şekilde eklendi !

# Student_Trainer_Role_Could_Not_Be_Added
source: Trainer role could not be added for student !
tr_tr: Öğrenci için eğitmen rolü eklenemedi !

# Student_Trainer_Role_Was_Added_Successfully
source: Trainer role was added successfully for student !
tr_tr: Öğrenci için eğitmen rolü başarılı bir şekilde eklendi !

source: Trainer has already been existed !
tr_tr: Eğitmen zaten sistemde bulunmakta !

# Category_AllCategories_Were_Got_Successfully
source: All categories were got successfully !
tr_tr: Tüm kategoriler başarılı bir şekilde getirildi !

# Category_AllCategories_Getting_Process_Was_Failed
source: All categories getting process was failed !
tr_tr: Tüm kategorileri getirme işlemi başarısız !

source: Category list has been empty !
tr_tr: Categori listesi boş !

source: Category was got successfully !
tr_tr: Kategori başarılı bir şekilde getirildi !

source: Category could not be got !
tr_tr: Kategori getirilemedi !

source: Course list has been empty !
tr_tr: Kurs listesi boş !

# Course_AllCourses_Were_Got_Successfully
source: All courses were got successfully !
tr_tr: Tüm kursları getirme işlemi başarılı !

# Course_AllCourses_Getting_Process_Was_Failed
source: All courses getting process was failed !
tr_tr: Tüm kursları getirme işlemi başarısız !

# Course_WantedCourses_Were_Got_Successfully
source: Wanted courses were got successfully !
tr_tr: İstenen kursları getirme işlemi başarılı !

# Course_WantedCourses_Getting_Process_Was_Failed
source: Wanted courses getting process was failed !
tr_tr: İstenen kursları getirme işlemi başarısız !

source: Course was got successfully !
tr_tr: Kurs başarılı bir şekilde getirildi !

source: Course could not be got !
tr_tr: Kurs getirilemedi !

# Course_Please_Enter_Name
source: Please enter course name !
tr_tr: Lütfen kurs adını giriniz !

# Course_Digits_ForName_Cannot_Be_Used
source: Digits cannot be used for course name !
tr_tr: Kurs adı için rakam kullanılamaz !

# Course_Symbols_ForName_Cannot_Be_Used
source: Symbols cannot be used for course name !
tr_tr: Kurs adı için sembol kullanılamaz !

# Course_Name_Cannot_Be_LessThan_2Characters
source: Course name length cannot be less than 2 characters !
tr_tr: Kurs adı en az 2 karakterden oluşmalıdır !

# Course_Name_Cannot_Be_GreaterThan_100Characters
source: Course name length cannot be greater than 100 characters !
tr_tr: Kurs adı en fazla 100 karakterden oluşmalıdır !

# Course_Please_Enter_ImageUrl
source: Please enter course image url !
tr_tr: Lütfen resim url'sini adını giriniz !

# Course_ImageUrl_Cannot_Be_LessThan_5Characters
source: Course image url length cannot be less than 5 characters !
tr_tr: Kurs resim url'si en az 5 karakterden oluşmalıdır !

# Course_ImageUrl_Cannot_Be_GreaterThan_250Characters
source: Course image url length cannot be greater than 250 characters !
tr_tr: Kurs image url'si en fazla 250 karakterden oluşmalıdır !

# Course_Please_Enter_Description
source: Please enter course description !
tr_tr: Lütfen kurs tanımını giriniz !

# Course_Digits_ForDescription_Cannot_Be_Used
source: Digits cannot be used for course description !
tr_tr: Kurs tanımı için rakam kullanılamaz !

# Course_Symbols_ForDescription_Cannot_Be_Used
source: Symbols cannot be used for course description !
tr_tr: Kurs tanımı için sembol kullanılamaz !

# Course_Description_Cannot_Be_LessThan_5Characters
source: Course description length cannot be less than 5 characters !
tr_tr: Kurs tanımı en az 5 karakterden oluşmalıdır !

# Course_Description_Cannot_Be_GreaterThan_450Characters
source: Course description length cannot be greater than 450 characters !
tr_tr: Kurs tanımı en fazla 450 karakterden oluşmalıdır !

# Course_Please_Enter_Price
source: Please enter course price !
tr_tr: Lütfen kurs ücretini giriniz !

# Course_Please_Enter_Currency
source: Please enter course currency !
tr_tr: Lütfen kurs döviz birimini giriniz !

# Course_Price_Must_Be_Min_0
source: Course price must be greater than or equal to 0 !
tr_tr: Kurs ücreti minimum 0 olmalıdır !

# Course_Please_Enter_CategoryId
source: Please enter course categoryId !
tr_tr: Lütfen kurs kategori id'sini giriniz !

# Course_Please_Enter_TrainerId
source: Please enter course trainer Id !
tr_tr: Lütfen kurs eğitmen id'sini giriniz !

source: Category was not found by Id !
tr_tr: Id'ye göre kategori bulunamadı !

source: Order list has been empty !
tr_tr: Sipariş listesi boş !

# Order_WantedOrders_Were_Got_Successfully
source: Wanted orders were got successfully !
tr_tr: İstenilen siparişleri getirme işlemi başarılı !

# Order_WantedOrder_Getting_Process_Was_Failed
source: Wanted orders getting process was failed !
tr_tr: İstenilen siparişleri getirme işlemi başarısız !

source: Payment list has been empty !
tr_tr: Ödeme listesi boş !

# Payment_WantedPayments_Were_Got_Successfully
source: Wanted payments were got successfully !
tr_tr: İstenilen ödemeleri getirme işlemi başarılı !

# Payment_WantedPayments_Getting_Process_Was_Failed
source: Wanted paments getting process was failed !
tr_tr: İstenilen ödemeleri getirme işlemi başarısız !

source: Payment could not be got !
tr_tr: Payment getirilemedi !

source: Payment was got successfully !
tr_tr: Ödeme başarılı bir şekilde getirildi !

# Category_Please_Enter_Name
source: Please enter category name !
tr_tr: Lütfen kategori adını giriniz !

# Category_Digits_ForName_Cannot_Be_Used
source: Digits cannot be used for category name !
tr_tr: Kategori adı için rakam kullanılamaz !

# Category_Symbols_ForName_Cannot_Be_Used
source: Symbols cannot be used for category name !
tr_tr: Kategori adı için sembol kullanılamaz !

# Category_Name_Cannot_Be_LessThan_2Characters
source: Category name length cannot be less than 2 characters !
tr_tr: Kategori adı en az 2 karakterden oluşmalıdır !

# Category_Name_Cannot_Be_GreaterThan_50Characters
source: Category name length cannot be greater than 50 characters !
tr_tr: Kategori adı en fazla 50 karakterden oluşmalıdır !

# Category_Name_Has_Already_Existed
source: This category name can not be used !
tr_tr: Bu kategori adı kullanılamaz !

source: Category was added successfully !
tr_tr: Kategori başarılı bir şekilde eklendi !

source: Category could not be added !
tr_tr: Kategori eklenemedi !

source: Course could not be added !
tr_tr: Kurs eklenemedi !

source: Course was added successfully !
tr_tr: Kurs başarılı bir şekilde eklendi !

source: Category was updated successfully !
tr_tr: Kategori başarılı bir şekilde güncellendi !

source: Category could not be updated !
tr_tr: Kategori güncellenemedi !

source: Category was deleted successfully !
tr_tr: Kategori başarılı bir şekilde silindi !

source: Category could not be deleted !
tr_tr: Kategori silinemedi !

# OrderCourse_Course_Has_Already_Existed
source: Course has already existed in this order !
tr_tr: Bu sipariş içinde kurs zaten var !

# OrderCourse_Was_Added_Successfully
source: Course was added to order successfully !
tr_tr: Kurs siparişe başarılı bir şekilde eklendi !

# OrderCourse_Could_Not_Be_Added
source: Course could not be added !
tr_tr: Kurs siparişe eklenemedi

# Redis_Cache_Entity_Was_Deleted
source: Entity was deleted to Redis cache !
tr_tr: Redis önbelleğine entity eklendi !

# Redis_Cache_Entity_Could_Not_Be_Deleted
source: Entity could not be deleted to Redis cache !
tr_tr: Redis önbelleğinden entity silinemedi !
